{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.1.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "signals_A"}, "name": "signals_A", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "ragged": false, "name": "dems_A"}, "name": "dems_A", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "signals_B"}, "name": "signals_B", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "ragged": false, "name": "dems_B"}, "name": "dems_B", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "signals_A"}, "name": "signals_A", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "Conv1D_1a", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 2], "filters": 256, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_1a", "inbound_nodes": [[["signals_A", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_1a", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_1a", "inbound_nodes": [[["Conv1D_1a", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization", "inbound_nodes": [[["MaxPooling_1a", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_3a", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_3a", "inbound_nodes": [[["layer_normalization", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_3a", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_3a", "inbound_nodes": [[["Conv1D_3a", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPoola", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPoola", "inbound_nodes": [[["layer_normalization", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_2", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_2", "inbound_nodes": [[["MaxPooling_3a", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPool_2a", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPool_2a", "inbound_nodes": [[["Skip_MaxPoola", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_4a", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_4a", "inbound_nodes": [[["layer_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Skip1a", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Skip1a", "inbound_nodes": [[["Skip_MaxPool_2a", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_4a", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_4a", "inbound_nodes": [[["Conv1D_4a", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_1", "inbound_nodes": [[["Conv1D_Skip1a", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["MaxPooling_4a", 0, 0, {}], ["layer_normalization_1", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_3", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_3", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_5a", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_5a", "inbound_nodes": [[["layer_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_5a", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_5a", "inbound_nodes": [[["Conv1D_5a", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPool_21a", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPool_21a", "inbound_nodes": [[["layer_normalization_3", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_5", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_5", "inbound_nodes": [[["MaxPooling_5a", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPool_22a", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPool_22a", "inbound_nodes": [[["Skip_MaxPool_21a", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_6a", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_6a", "inbound_nodes": [[["layer_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Skip2a", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Skip2a", "inbound_nodes": [[["Skip_MaxPool_22a", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_6a", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_6a", "inbound_nodes": [[["Conv1D_6a", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_4", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_4", "inbound_nodes": [[["Conv1D_Skip2a", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["MaxPooling_6a", 0, 0, {}], ["layer_normalization_4", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_6", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_6", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_7a", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_7a", "inbound_nodes": [[["layer_normalization_6", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_7a", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_7a", "inbound_nodes": [[["Conv1D_7a", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPool_31a", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPool_31a", "inbound_nodes": [[["layer_normalization_6", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_8", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_8", "inbound_nodes": [[["MaxPooling_7a", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPool_32a", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPool_32a", "inbound_nodes": [[["Skip_MaxPool_31a", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_8a", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_8a", "inbound_nodes": [[["layer_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Skip3a", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Skip3a", "inbound_nodes": [[["Skip_MaxPool_32a", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_8a", "trainable": true, "dtype": "float32", "strides": [4], "pool_size": [4], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_8a", "inbound_nodes": [[["Conv1D_8a", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_7", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_7", "inbound_nodes": [[["Conv1D_Skip3a", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["MaxPooling_8a", 0, 0, {}], ["layer_normalization_7", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_9", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_9", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["layer_normalization_9", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "ragged": false, "name": "dems_A"}, "name": "dems_A", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["flatten", 0, 0, {}], ["dems_A", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["signals_A", 0, 0], ["dems_A", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "name": "model", "inbound_nodes": [[["signals_A", 0, 0, {}], ["dems_A", 0, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "signals_A"}, "name": "signals_A", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "Conv1D_1b", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 500, 2], "filters": 256, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_1b", "inbound_nodes": [[["signals_A", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_1b", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_1b", "inbound_nodes": [[["Conv1D_1b", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_10", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_10", "inbound_nodes": [[["MaxPooling_1b", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_3b", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_3b", "inbound_nodes": [[["layer_normalization_10", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_3b", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_3b", "inbound_nodes": [[["Conv1D_3b", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPoolb", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPoolb", "inbound_nodes": [[["layer_normalization_10", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_12", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_12", "inbound_nodes": [[["MaxPooling_3b", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPool_2b", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPool_2b", "inbound_nodes": [[["Skip_MaxPoolb", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_4b", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_4b", "inbound_nodes": [[["layer_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Skip1b", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Skip1b", "inbound_nodes": [[["Skip_MaxPool_2b", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_4b", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_4b", "inbound_nodes": [[["Conv1D_4b", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_11", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_11", "inbound_nodes": [[["Conv1D_Skip1b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["MaxPooling_4b", 0, 0, {}], ["layer_normalization_11", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_13", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_13", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_5b", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_5b", "inbound_nodes": [[["layer_normalization_13", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_5b", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_5b", "inbound_nodes": [[["Conv1D_5b", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPool_21b", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPool_21b", "inbound_nodes": [[["layer_normalization_13", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_15", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_15", "inbound_nodes": [[["MaxPooling_5b", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPool_22b", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPool_22b", "inbound_nodes": [[["Skip_MaxPool_21b", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_6b", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_6b", "inbound_nodes": [[["layer_normalization_15", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Skip2b", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Skip2b", "inbound_nodes": [[["Skip_MaxPool_22b", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_6b", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_6b", "inbound_nodes": [[["Conv1D_6b", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_14", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_14", "inbound_nodes": [[["Conv1D_Skip2b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["MaxPooling_6b", 0, 0, {}], ["layer_normalization_14", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_16", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_16", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_7b", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_7b", "inbound_nodes": [[["layer_normalization_16", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_7b", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_7b", "inbound_nodes": [[["Conv1D_7b", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPool_31b", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPool_31b", "inbound_nodes": [[["layer_normalization_16", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_18", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_18", "inbound_nodes": [[["MaxPooling_7b", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "Skip_MaxPool_32b", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "Skip_MaxPool_32b", "inbound_nodes": [[["Skip_MaxPool_31b", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_8b", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_8b", "inbound_nodes": [[["layer_normalization_18", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "Conv1D_Skip3b", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1D_Skip3b", "inbound_nodes": [[["Skip_MaxPool_32b", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "MaxPooling_8b", "trainable": true, "dtype": "float32", "strides": [4], "pool_size": [4], "padding": "valid", "data_format": "channels_last"}, "name": "MaxPooling_8b", "inbound_nodes": [[["Conv1D_8b", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_17", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_17", "inbound_nodes": [[["Conv1D_Skip3b", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "name": "add_5", "inbound_nodes": [[["MaxPooling_8b", 0, 0, {}], ["layer_normalization_17", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_19", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_19", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [[["layer_normalization_19", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "ragged": false, "name": "dems_A"}, "name": "dems_A", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["flatten_1", 0, 0, {}], ["dems_A", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["signals_A", 0, 0], ["dems_A", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "name": "model_1", "inbound_nodes": [[["signals_B", 0, 0, {}], ["dems_B", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["model", 1, 0, {}], ["model_1", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Latent_Semantic", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Latent_Semantic", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["Latent_Semantic", 0, 0, {}]]]}], "input_layers": [["signals_A", 0, 0], ["dems_A", 0, 0], ["signals_B", 0, 0], ["dems_B", 0, 0]], "output_layers": [["dense_6", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "Latent_Semantic/kernel", "shape": [128, 4], "dtype": "float32"}, {"name": "Latent_Semantic/bias", "shape": [4], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [4, 2], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [2], "dtype": "float32"}, {"name": "Conv1D_1a/kernel", "shape": [2, 2, 256], "dtype": "float32"}, {"name": "Conv1D_1a/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization/beta", "shape": [256], "dtype": "float32"}, {"name": "Conv1D_3a/kernel", "shape": [2, 256, 192], "dtype": "float32"}, {"name": "Conv1D_3a/bias", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_2/gamma", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_2/beta", "shape": [192], "dtype": "float32"}, {"name": "Conv1D_4a/kernel", "shape": [2, 192, 192], "dtype": "float32"}, {"name": "Conv1D_4a/bias", "shape": [192], "dtype": "float32"}, {"name": "Conv1D_Skip1a/kernel", "shape": [2, 256, 192], "dtype": "float32"}, {"name": "Conv1D_Skip1a/bias", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_1/gamma", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_1/beta", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_3/gamma", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_3/beta", "shape": [192], "dtype": "float32"}, {"name": "Conv1D_5a/kernel", "shape": [2, 192, 192], "dtype": "float32"}, {"name": "Conv1D_5a/bias", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_5/gamma", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_5/beta", "shape": [192], "dtype": "float32"}, {"name": "Conv1D_6a/kernel", "shape": [2, 192, 128], "dtype": "float32"}, {"name": "Conv1D_6a/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv1D_Skip2a/kernel", "shape": [2, 192, 128], "dtype": "float32"}, {"name": "Conv1D_Skip2a/bias", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_4/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_4/beta", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_6/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_6/beta", "shape": [128], "dtype": "float32"}, {"name": "Conv1D_7a/kernel", "shape": [2, 128, 96], "dtype": "float32"}, {"name": "Conv1D_7a/bias", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_8/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_8/beta", "shape": [96], "dtype": "float32"}, {"name": "Conv1D_8a/kernel", "shape": [2, 96, 96], "dtype": "float32"}, {"name": "Conv1D_8a/bias", "shape": [96], "dtype": "float32"}, {"name": "Conv1D_Skip3a/kernel", "shape": [2, 128, 96], "dtype": "float32"}, {"name": "Conv1D_Skip3a/bias", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_7/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_7/beta", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_9/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_9/beta", "shape": [96], "dtype": "float32"}, {"name": "dense/kernel", "shape": [197, 256], "dtype": "float32"}, {"name": "dense/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv1D_1b/kernel", "shape": [2, 2, 256], "dtype": "float32"}, {"name": "Conv1D_1b/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_10/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_10/beta", "shape": [256], "dtype": "float32"}, {"name": "Conv1D_3b/kernel", "shape": [2, 256, 192], "dtype": "float32"}, {"name": "Conv1D_3b/bias", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_12/gamma", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_12/beta", "shape": [192], "dtype": "float32"}, {"name": "Conv1D_4b/kernel", "shape": [2, 192, 192], "dtype": "float32"}, {"name": "Conv1D_4b/bias", "shape": [192], "dtype": "float32"}, {"name": "Conv1D_Skip1b/kernel", "shape": [2, 256, 192], "dtype": "float32"}, {"name": "Conv1D_Skip1b/bias", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_11/gamma", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_11/beta", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_13/gamma", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_13/beta", "shape": [192], "dtype": "float32"}, {"name": "Conv1D_5b/kernel", "shape": [2, 192, 192], "dtype": "float32"}, {"name": "Conv1D_5b/bias", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_15/gamma", "shape": [192], "dtype": "float32"}, {"name": "layer_normalization_15/beta", "shape": [192], "dtype": "float32"}, {"name": "Conv1D_6b/kernel", "shape": [2, 192, 128], "dtype": "float32"}, {"name": "Conv1D_6b/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv1D_Skip2b/kernel", "shape": [2, 192, 128], "dtype": "float32"}, {"name": "Conv1D_Skip2b/bias", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_14/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_14/beta", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_16/gamma", "shape": [128], "dtype": "float32"}, {"name": "layer_normalization_16/beta", "shape": [128], "dtype": "float32"}, {"name": "Conv1D_7b/kernel", "shape": [2, 128, 96], "dtype": "float32"}, {"name": "Conv1D_7b/bias", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_18/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_18/beta", "shape": [96], "dtype": "float32"}, {"name": "Conv1D_8b/kernel", "shape": [2, 96, 96], "dtype": "float32"}, {"name": "Conv1D_8b/bias", "shape": [96], "dtype": "float32"}, {"name": "Conv1D_Skip3b/kernel", "shape": [2, 128, 96], "dtype": "float32"}, {"name": "Conv1D_Skip3b/bias", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_17/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_17/beta", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_19/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_19/beta", "shape": [96], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [197, 256], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [128], "dtype": "float32"}]}]}